
<!--
git revert хэш коммита // удаление комита
git commit --amend // изменение название комита
git reset HEAD имя файла // откат от комита
git checkout -- имя файла // откат от добавления файла
git log // выводит ранее деланные комиты
git diff HEAD~1 HEAD~2 || git diff хэш1 хэш2 позволяет увидить изменённые комиты
git rm название файла // позволяет удалить файл из репозитория (делаем коммит после команды, чтобы удалилась)
git rm -r название папки // удаляет папку из репозитория
git reset --hard хэш коммита // удаляет верхние комиты так делать опасно и не рекомендуемо

-->